RoboticWorx/PolyCast5/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32c5"
CONFIG_IDF_EXPERIMENTAL_FEATURES=y

# Flash
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# Partition Table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
# 0x10000 leaves 56KB bootloader room: ~34KB FE-only today, ~46KB if SBv2 added later
CONFIG_PARTITION_TABLE_OFFSET=0x10000

# Bootloader
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
CONFIG_BOOTLOADER_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_BOOTLOADER_LOG_LEVEL_INFO=y

# CPU
# Kconfig silently drops this to 160 when FE is on (silicon errata: encrypted
# flash writes are unsupported at 240 MHz, and IDF's auto-drop workaround
# SPI_FLASH_FREQ_LIMIT_C5_240MHZ is compiled out in FE builds). main.c
# runtime-raises DFS to 240 on chip rev v1.2+ (v1.0 stays at 160), and
# wifi_ota_update.c manually drops to 160 around encrypted flash writes.
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# PINNED, DO NOT REMOVE. RTC FAST RAM must stay out of the heap. That region runs on the
# APB clock, and reading it from a 240 MHz core drops address bit 0x40000000: the heap
# control pointer 0x500000bc reads back as 0x100000bc, so ANY caller that walks every
# internal heap takes a load fault. heap_caps_get_largest_free_block() is one, and
# spi_flash's get_buffer_malloc() calls it on every unaligned esp_flash_read -- so this
# reliably kills LittleFS reads (observed 2026-09-19 loading /assets/anim/...).
# Costs 15 KiB of the ~200 KiB internal pool. Deep-sleep retention is placed by the
# linker, not the allocator, so nothing else is affected.
# This line was silently lost once already and the crash came straight back; if it
# disappears from sdkconfig again, put it back before debugging anything else.
CONFIG_ESP_SYSTEM_ALLOW_RTC_FAST_MEM_AS_HEAP=n

# IRAM budget: buy back some of the 15.8 KiB the line above costs us.
# These three place light-sleep code in IRAM purely for entry/exit LATENCY -- Kconfig quantifies
# PM_SLP_IRAM_OPT as "about 2.1KB ... and chip would sleep longer for 310us at 160MHz ... each
# time". Correctness does not depend on them; anything that genuinely must run with the cache
# down is IRAM_ATTR unconditionally.
# We DO use light sleep (lcd_utils.c 6 h battery check, and main.c ext1 wake on TCA9535_INT for
# the power-off state) -- but only a couple of entries per day, not tickless, so ~310 us per
# entry is noise. ESP_WIFI_SLP_IRAM_OPT would matter for Wi-Fi modem sleep, which is frequent,
# except we call espnow_utils_wifi_radio_stop() at boot and keep the radio off by default.
CONFIG_ESP_WIFI_SLP_IRAM_OPT=n
CONFIG_PM_SLEEP_FUNC_IN_IRAM=n
CONFIG_PM_SLP_IRAM_OPT=n
# Keep these in IRAM even though PM_SLEEP_FUNC_IN_IRAM no longer selects them:
# RTC_CLK is the DFS hot path (rtc_clk_cpu_freq_set_config_fast on every 240<->160<->40 switch),
# and PERIPH_CTRL / REGI2C are documented as needing to be "IRAM-safe and able to be called in
# the other IRAM interrupt context" -- we have ESP_INTR_IN_IRAM=y and RMT ISRs for IR.
CONFIG_RTC_CLK_FUNC_IN_IRAM=y
CONFIG_ESP_PERIPH_CTRL_FUNC_IN_IRAM=y
CONFIG_ESP_REGI2C_CTRL_FUNC_IN_IRAM=y

# PSRAM / SPIRAM
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MEMTEST=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=0
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=49152
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y
CONFIG_SPIRAM_ALLOW_NOINIT_SEG_EXTERNAL_MEMORY=y
CONFIG_SPIRAM_ALLOW_STACK_EXTERNAL_MEMORY=y

# Bluetooth NimBLE
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_CONTROLLER_ENABLED=y
CONFIG_BT_NIMBLE_MEM_ALLOC_MODE_EXTERNAL=y
CONFIG_BT_NIMBLE_PINNED_TO_CORE=0
CONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=4096
CONFIG_BT_NIMBLE_ROLE_CENTRAL=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
CONFIG_BT_NIMBLE_ROLE_OBSERVER=y
CONFIG_BT_NIMBLE_GATT_CLIENT=y
CONFIG_BT_NIMBLE_GATT_SERVER=y
CONFIG_BT_NIMBLE_SECURITY_ENABLE=y
CONFIG_BT_NIMBLE_SM_LEGACY=y
CONFIG_BT_NIMBLE_SM_SC=y
CONFIG_BT_NIMBLE_SM_LVL=2
CONFIG_BT_NIMBLE_NVS_PERSIST=y
CONFIG_BT_NIMBLE_MAX_BONDS=16
CONFIG_BT_NIMBLE_RPA_TIMEOUT=900
CONFIG_BT_NIMBLE_WHITELIST_SIZE=16
CONFIG_BT_NIMBLE_ENABLE_CONN_REATTEMPT=y
CONFIG_BT_NIMBLE_MAX_CONN_REATTEMPT=3
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=16
CONFIG_BT_NIMBLE_MAX_CCCDS=16
CONFIG_BT_NIMBLE_CRYPTO_STACK_MBEDTLS=y
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=256
CONFIG_BT_NIMBLE_ATT_MAX_PREP_ENTRIES=64
CONFIG_BT_NIMBLE_GATT_MAX_PROCS=4
CONFIG_BT_NIMBLE_L2CAP_COC_MAX_NUM=0
CONFIG_BT_NIMBLE_MSYS_1_BLOCK_COUNT=24
CONFIG_BT_NIMBLE_MSYS_1_BLOCK_SIZE=128
CONFIG_BT_NIMBLE_MSYS_2_BLOCK_COUNT=24
CONFIG_BT_NIMBLE_MSYS_2_BLOCK_SIZE=320
CONFIG_BT_NIMBLE_MSYS_BUF_FROM_HEAP=y
CONFIG_BT_NIMBLE_TRANSPORT_ACL_FROM_LL_COUNT=24
CONFIG_BT_NIMBLE_TRANSPORT_ACL_SIZE=255
CONFIG_BT_NIMBLE_TRANSPORT_EVT_SIZE=70
CONFIG_BT_NIMBLE_TRANSPORT_EVT_COUNT=30
CONFIG_BT_NIMBLE_TRANSPORT_EVT_DISCARD_COUNT=8
CONFIG_BT_NIMBLE_50_FEATURE_SUPPORT=y
CONFIG_BT_NIMBLE_LL_CFG_FEAT_LE_2M_PHY=y
CONFIG_BT_NIMBLE_LL_CFG_FEAT_LE_CODED_PHY=y
CONFIG_BT_NIMBLE_EXT_SCAN=y
CONFIG_BT_NIMBLE_ENABLE_PERIODIC_SYNC=y
CONFIG_BT_NIMBLE_SVC_GAP_DEVICE_NAME="PolyCast5"
CONFIG_BT_NIMBLE_GAP_DEVICE_NAME_MAX_LEN=31
CONFIG_BT_NIMBLE_SVC_GAP_APPEARANCE=0
CONFIG_BT_NIMBLE_SVC_HID_MAX_INSTANCES=2
CONFIG_BT_NIMBLE_SVC_HID_MAX_RPTS=3
CONFIG_BT_NIMBLE_MEM_OPTIMIZATION=y
CONFIG_BT_NIMBLE_STATIC_TO_DYNAMIC=y
CONFIG_BT_NIMBLE_RECONFIG_MTU=y
CONFIG_BT_NIMBLE_LOG_LEVEL_INFO=y
CONFIG_BT_LE_CONTROLLER_TASK_STACK_SIZE=4096
CONFIG_BT_LE_LL_RESOLV_LIST_SIZE=5
CONFIG_BT_LE_LL_DUP_SCAN_LIST_COUNT=20
CONFIG_BT_LE_DFT_TX_POWER_LEVEL_P12=y
CONFIG_BT_ALARM_MAX_NUM=50

# BT Identity
CONFIG_BT_NIMBLE_SMP_ID_RESET=y

# BT HID / GATT Services
CONFIG_BT_NIMBLE_HID_SERVICE=y
CONFIG_BT_NIMBLE_BAS_SERVICE=y
CONFIG_BT_NIMBLE_DIS_SERVICE=y
CONFIG_BT_NIMBLE_GAP_SERVICE=y
CONFIG_ESPHID_TASK_SIZE_BT=2048
CONFIG_ESPHID_TASK_SIZE_BLE=4096

# BT Coexistence
CONFIG_ESP_COEX_SW_COEXIST_ENABLE=y

# WiFi
CONFIG_ESP_WIFI_DYNAMIC_RX_MGMT_BUFFER=y
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=6
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP_WIFI_STATIC_TX_BUFFER=y
CONFIG_ESP_WIFI_STATIC_TX_BUFFER_NUM=4
CONFIG_ESP_WIFI_CACHE_TX_BUFFER_NUM=24
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=y
CONFIG_ESP_WIFI_TX_BA_WIN=6
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=y
CONFIG_ESP_WIFI_RX_BA_WIN=6
CONFIG_ESP_WIFI_SOFTAP_BEACON_MAX_LEN=752
CONFIG_ESP_WIFI_MGMT_SBUF_NUM=32
CONFIG_ESP_WIFI_IRAM_OPT=y
CONFIG_ESP_WIFI_EXTRA_IRAM_OPT=y
CONFIG_ESP_WIFI_RX_IRAM_OPT=y
CONFIG_ESP_WIFI_ENABLE_WPA3_SAE=y
CONFIG_ESP_WIFI_ENABLE_SAE_PK=y
CONFIG_ESP_WIFI_ENABLE_SAE_H2E=y
CONFIG_ESP_WIFI_SOFTAP_SAE_SUPPORT=y
CONFIG_ESP_WIFI_ENABLE_WPA3_OWE_STA=y
CONFIG_ESP_WIFI_SLP_IRAM_OPT=y
CONFIG_ESP_WIFI_STA_DISCONNECTED_PM_ENABLE=y
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=y
CONFIG_ESP_WIFI_ESPNOW_MAX_ENCRYPT_NUM=7
CONFIG_ESP_WIFI_ENTERPRISE_SUPPORT=y

# Core voltage. ON, which is also IDF's default and what Kconfig calls "a must for stable
# mass production" (a fixed dbias would stop tracking temperature).
# Stated explicitly only because PVT was investigated and EXONERATED on 2026-09-19: our two
# batches differ in eFuse block rev (v0.3 vs v0.4) and the v0.3 stock reads PVT_DBIAS = 0,
# which looked like an uncharacterised auto-dbias loop. It was not the cause. The crashes
# were RTC FAST RAM in the heap plus the ROM TLSF (see the two pinned settings above/below),
# and they persisted with PVT off and stopped with PVT on. Do not disable this again.
CONFIG_ESP_ENABLE_PVT=y

# Heap
CONFIG_HEAP_PLACE_FUNCTION_INTO_FLASH=y
# Build TLSF from IDF source instead of calling the ROM copy. Two reasons, both live:
# (1) ROM faults carry no symbols, so every TLSF crash we chased decoded to unrelated ROM
#     names (lldesc_build_chain, sip_from_host_avail_cb) and cost days.
# (2) ROM cannot receive fixes -- esp_rom_caps.h already declares ESP_ROM_TLSF_CHECK_PATCH
#     for C5 ("ROM does not contain the patch of tlsf_check_pool()"). The ROM copy also has
#     poison fill/check function pointers that IDF only registers when poisoning is compiled
#     in; with poisoning off those hooks are never set, and one crash was an indirect jump to
#     0x00000000 with RA inside ROM TLSF. The IDF source has no such indirection at all.
# Costs IRAM in general, but HEAP_PLACE_FUNCTION_INTO_FLASH above puts it in flash anyway.
# PROVEN LOAD-BEARING 2026-09-19, do not remove. Single-variable A/B on one unit, all
# else held constant (poisoning off, PVT off, 240 MHz, PSRAM 80M):
#   ROM TLSF    -> "assert failed: block_locate_free tlsf/tlsf.c:569" within minutes,
#                  PSRAM heap TLSF control block (0x423b70f4) implicated, frame in ROM
#   source TLSF -> clean
# Not a detection artefact: the IDF source carries the identical tlsf_assert and
# ASSERTION_LEVEL=2 keeps it live, so the same corruption would have aborted identically.
# The two are genuinely different implementations - IDF's source parameterises control_t
# at runtime (fl_index_count / sl_index_count / small_block_size), a rework postdating the
# ROM freeze - which is the case Kconfig warns about: ROM cannot receive bug fixes.
CONFIG_HEAP_TLSF_USE_ROM_IMPL=n

# FreeRTOS
CONFIG_FREERTOS_HZ=100
CONFIG_FREERTOS_OPTIMIZED_SCHEDULER=y
CONFIG_FREERTOS_CHECK_STACKOVERFLOW_CANARY=y
CONFIG_FREERTOS_IDLE_TASK_STACKSIZE=1536
CONFIG_FREERTOS_TIMER_TASK_PRIORITY=1
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=2048
CONFIG_FREERTOS_ISR_STACKSIZE=1536
CONFIG_FREERTOS_TASK_CREATE_ALLOW_EXT_MEM=y
# Note: CONFIG_FREERTOS_PLACE_FUNCTIONS_INTO_FLASH removed in v6.0
# FreeRTOS functions are in flash by default (FREERTOS_IN_IRAM=n)

# Stack Sizes
CONFIG_ESP_MAIN_TASK_STACK_SIZE=3584
CONFIG_ESP_TIMER_TASK_STACK_SIZE=3584
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=2304
CONFIG_LWIP_TCPIP_TASK_STACK_SIZE=3072
CONFIG_PTHREAD_TASK_STACK_SIZE_DEFAULT=3072
CONFIG_PTHREAD_STACK_MIN=768

# Console
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_SECONDARY_USB_SERIAL_JTAG=y

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Watchdog
CONFIG_ESP_INT_WDT_TIMEOUT_MS=300
CONFIG_ESP_TASK_WDT_TIMEOUT_S=5

# Brownout
CONFIG_ESP_BROWNOUT_DET=y
CONFIG_ESP_BROWNOUT_DET_LVL_SEL_7=y

# LWIP
CONFIG_LWIP_MAX_SOCKETS=10
CONFIG_LWIP_SO_REUSE=y
CONFIG_LWIP_SO_REUSE_RXTOALL=y
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=32
CONFIG_LWIP_DHCPS_MAX_STATION_NUM=8
CONFIG_LWIP_IPV6=y
CONFIG_LWIP_MAX_ACTIVE_TCP=16
CONFIG_LWIP_MAX_LISTENING_TCP=16
CONFIG_LWIP_TCP_MSS=1440
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=5760
CONFIG_LWIP_TCP_WND_DEFAULT=5760
CONFIG_LWIP_TCP_RECVMBOX_SIZE=6
CONFIG_LWIP_MAX_UDP_PCBS=16
CONFIG_LWIP_MAX_RAW_PCBS=16

# HTTP Server
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512

# MbedTLS
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
CONFIG_MBEDTLS_ASYMMETRIC_CONTENT_LEN=y
CONFIG_MBEDTLS_SSL_IN_CONTENT_LEN=16384
CONFIG_MBEDTLS_SSL_OUT_CONTENT_LEN=4096
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_CROSS_SIGNED_VERIFY=y
CONFIG_MBEDTLS_HARDWARE_AES=y
CONFIG_MBEDTLS_HARDWARE_MPI=y
CONFIG_MBEDTLS_HARDWARE_SHA=y
CONFIG_MBEDTLS_HARDWARE_ECC=y
CONFIG_MBEDTLS_HARDWARE_ECDSA_VERIFY=y
# Pinned, do not trim: with hardware AES the PSA AEAD dispatch calls the ESP GCM driver first, and
# this option is what lets a non-GCM algorithm fall through to software. Turning it off makes the
# driver's PSA_ERROR_NOT_SUPPORTED the final answer, so every AES-CCM call fails at runtime while
# still building clean - which would silently kill both lora_pcp and espnow_auth.
CONFIG_MBEDTLS_GCM_SUPPORT_NON_AES_CIPHER=y
# Pinned: lora_task and espnow_task share PSA key slots, so the PSA core must be mutex-protected.
CONFIG_MBEDTLS_THREADING_C=y

# FATFS
CONFIG_FATFS_ALLOC_PREFER_EXTRAM=y

# LVGL
CONFIG_LV_CONF_SKIP=y
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_COLOR_DEPTH=16
CONFIG_LV_MEM_SIZE_KILOBYTES=64
CONFIG_LV_DEF_REFR_PERIOD=33
CONFIG_LV_DPI_DEF=130
CONFIG_LV_OS_NONE=y
CONFIG_LV_DRAW_BUF_STRIDE_ALIGN=1
CONFIG_LV_DRAW_BUF_ALIGN=4
CONFIG_LV_DRAW_LAYER_SIMPLE_BUF_SIZE=24576
CONFIG_LV_USE_DRAW_SW=y
CONFIG_LV_DRAW_SW_DRAW_UNIT_CNT=1
CONFIG_LV_DRAW_SW_COMPLEX=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_DEFAULT_MONTSERRAT_14=y
CONFIG_LV_USE_THEME_DEFAULT=y
CONFIG_LV_THEME_DEFAULT_TRANSITION_TIME=80
CONFIG_LV_USE_FLEX=y
CONFIG_LV_USE_GRID=y
CONFIG_LV_USE_OBSERVER=y
CONFIG_LV_BUILD_EXAMPLES=y

# LittleFS - perf tuning (large sequential reads, PSRAM-only allocation)
CONFIG_LITTLEFS_MALLOC_STRATEGY_SPIRAM=y
CONFIG_LITTLEFS_CACHE_SIZE=4096
CONFIG_LITTLEFS_READ_SIZE=512
CONFIG_LITTLEFS_WRITE_SIZE=512
CONFIG_LITTLEFS_PAGE_SIZE=1024
CONFIG_LITTLEFS_USE_MTIME=n

# Compiler
CONFIG_COMPILER_OPTIMIZATION_DEBUG=y

# PHY / RF
CONFIG_ESP_PHY_MAX_WIFI_TX_POWER=20
CONFIG_ESP_PHY_RF_CAL_PARTIAL=y
CONFIG_ESP_PHY_IRAM_OPT=y

# Memory / Cache
CONFIG_MMU_PAGE_SIZE_64KB=y

# Power Management
# DFS scales CPU based on load; tickless idle skips ticks while
# all tasks are blocked. Drivers (Wi-Fi, BT, SPI, I2C, RMT) auto-acquire PM locks
# during use so they keep the clocks they need. Auto light-sleep requires
# esp_pm_configure() with light_sleep_enable=true at runtime (not enabled by default).
CONFIG_PM_ENABLE=y
CONFIG_PM_DFS_INIT_AUTO=y
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y
CONFIG_FREERTOS_IDLE_TIME_BEFORE_SLEEP=3
CONFIG_PM_POWER_DOWN_CPU_IN_LIGHT_SLEEP=y
CONFIG_PM_POWER_DOWN_PERIPHERAL_IN_LIGHT_SLEEP=y
CONFIG_ESP_SLEEP_FLASH_LEAKAGE_WORKAROUND=y
CONFIG_ESP_SLEEP_PSRAM_LEAKAGE_WORKAROUND=y

# Flash Encryption
# DEVELOPMENT mode: re-flashable plaintext images during bring-up.
# PSRAM contents are automatically encrypted with the same XTS-AES key on ESP32-C5.
# To lock a device down (RELEASE mode + Secure Boot v2), do NOT edit this file:
# set POLYCAST5_SECURE_RELEASE to 1 in CMakeLists.txt, which layers
# sdkconfig.defaults.secure on top of this one.
# Full guide at www.polycast5.com/blogs/docs/lock-it-down
CONFIG_SECURE_FLASH_ENC_ENABLED=y
CONFIG_SECURE_FLASH_ENCRYPTION_MODE_DEVELOPMENT=y
CONFIG_SECURE_FLASH_ENCRYPTION_AES128=y

# NVS Encryption (uses XTS key in encrypted nvs_keys partition)
CONFIG_NVS_ENCRYPTION=y
CONFIG_NVS_SEC_KEY_PROTECT_USING_FLASH_ENC=y

# Custom
CONFIG_EXAMPLE_MEDIA_ENABLE=y
CONFIG_EXAMPLE_HID_DEVICE_ROLE=1
